In [16]:
SHOW DATABASES;

Database
GRUPOS
information_schema
mysql
performance_schema
test

In [17]:
CREATE DATABASE test;

CREATE TABLE test.books (book_id INT, title TEXT, status INT);

SHOW TABLES FROM test;

USE test;

SHOW TABLES;

DESCRIBE books;

Can't create database 'test'; database exists
ERROR 1050 (42S01) at line 3 in file: '/home/sergior/Escritorio/Big data/LearningMySQLMariaDB/.mariadb_statement': Table 'books' already exists
(B(B(B(B<TABLE BORDER=1><TR><TH>Tables_in_test</TH></TR><TR><TD>books</TD></TR></TABLE><TABLE BORDER=1><TR><TH>Tables_in_test</TH></TR><TR><TD>books</TD></TR></TABLE><TABLE BORDER=1><TR><TH>Field</TH><TH>Type</TH><TH>Null</TH><TH>Key</TH><TH>Default</TH><TH>Extra</TH></TR><TR><TD>book_id</TD><TD>int(11)</TD><TD>YES</TD><TD></TD><TD>NULL</TD><TD></TD></TR><TR><TD>title</TD><TD>text</TD><TD>YES</TD><TD></TD><TD>NULL</TD><TD></TD></TR><TR><TD>status</TD><TD>int(11)</TD><TD>YES</TD><TD></TD><TD>NULL</TD><TD></TD></TR></TABLE>

In [18]:
USE test;

In [3]:
INSERT INTO books VALUES(100,'Heart of Darkness',0);

In [4]:
INSERT INTO books VALUES(101,'The Catcher of the Rye',1);

In [5]:
INSERT INTO books VALUES(102,'My Antonia',0);

In [7]:
SELECT * FROM books;

book_id,title,status
100,Heart of Darkness,0
101,The Catcher of the Rye,1
102,My Antonia,0

In [11]:
#Este es un comentario;

In [12]:
SELECT * FROM books WHERE status =1;

book_id,title,status
101,The Catcher of the Rye,1

In [22]:
select * from books where status =1;
#Funciona igual en minusculas;

book_id,title,status
101,The Catcher of the Rye,1

In [24]:
SELECT * FROM books WHERE status=0;

book_id,title,status
100,Heart of Darkness,0
102,My Antonia,0

In [35]:
# SELECT * FROM books WHERE status=0 \G ;
#El comando anterior \G no funciona bien en jupyter, pero en la terminal, no tiene problema en desplegar;

In [36]:
UPDATE books SET status =1 WHERE book_id =102;

In [38]:
UPDATE books SET status =1 WHERE title ='My Antonia'; 
#Funciona tambien con el titulo del libro;

In [39]:
SELECT * FROM books WHERE status =1;

book_id,title,status
101,The Catcher of the Rye,1
102,My Antonia,1

In [40]:
UPDATE books SET status =0 WHERE book_id =101;

In [41]:
SELECT * FROM books WHERE status =1;

book_id,title,status
102,My Antonia,1

In [42]:
SELECT * FROM books WHERE status =0;

book_id,title,status
100,Heart of Darkness,0
101,The Catcher of the Rye,0

In [43]:
UPDATE books
SET title= 'The Catcher in the Rye', status=1
WHERE book_id =101;

In [62]:
DROP TABLE status_names;

In [63]:
CREATE TABLE status_names (status_id INT, status_name CHAR(8));

In [65]:
INSERT INTO status_names VALUES(0,'Inactive'), (1, 'Active');

In [66]:
SELECT * FROM status_names;

status_id,status_name
0,Inactive
1,Active

In [68]:
SELECT book_id, title, status_name 
FROM books JOIN status_names 
WHERE status=status_id;

book_id,title,status_name
100,Heart of Darkness,Inactive
101,The Catcher in the Rye,Active
102,My Antonia,Active